{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "adventurous",
    "1": "affordable",
    "2": "artistic",
    "3": "authentic",
    "4": "cheap",
    "5": "comfortable",
    "6": "cozy",
    "7": "creative",
    "8": "crowded",
    "9": "cultural",
    "10": "exciting",
    "11": "expensive",
    "12": "faith",
    "13": "family-friendly",
    "14": "genuine",
    "15": "good for couples",
    "16": "good value",
    "17": "high-end",
    "18": "historical",
    "19": "lively",
    "20": "local_gem",
    "21": "luxury",
    "22": "modern",
    "23": "peaceful",
    "24": "quiet",
    "25": "relaxing",
    "26": "religious",
    "27": "romantic",
    "28": "spiritual",
    "29": "thrilling",
    "30": "tourist-friendly",
    "31": "touristy",
    "32": "traditional",
    "33": "vibrant"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "adventurous": 0,
    "affordable": 1,
    "artistic": 2,
    "authentic": 3,
    "cheap": 4,
    "comfortable": 5,
    "cozy": 6,
    "creative": 7,
    "crowded": 8,
    "cultural": 9,
    "exciting": 10,
    "expensive": 11,
    "faith": 12,
    "family-friendly": 13,
    "genuine": 14,
    "good for couples": 15,
    "good value": 16,
    "high-end": 17,
    "historical": 18,
    "lively": 19,
    "local_gem": 20,
    "luxury": 21,
    "modern": 22,
    "peaceful": 23,
    "quiet": 24,
    "relaxing": 25,
    "religious": 26,
    "romantic": 27,
    "spiritual": 28,
    "thrilling": 29,
    "tourist-friendly": 30,
    "touristy": 31,
    "traditional": 32,
    "vibrant": 33
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "PhobertTokenizer",
  "transformers_version": "4.57.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
