{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "adventurous",
    "1": "family-friendly",
    "2": "festive",
    "3": "historical",
    "4": "lively",
    "5": "local_gem",
    "6": "modern",
    "7": "peaceful",
    "8": "romantic",
    "9": "scenic",
    "10": "seaside",
    "11": "spiritual",
    "12": "touristy"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "adventurous": 0,
    "family-friendly": 1,
    "festive": 2,
    "historical": 3,
    "lively": 4,
    "local_gem": 5,
    "modern": 6,
    "peaceful": 7,
    "romantic": 8,
    "scenic": 9,
    "seaside": 10,
    "spiritual": 11,
    "touristy": 12
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "tokenizer_class": "PhobertTokenizer",
  "transformers_version": "4.57.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
